#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("ТестированиеДвиженийТоплива").ВТранзакции()
		.ДобавитьТест("ПриходРасходТопливаУспешноеСоздание", 		"", "Позитив, Нефедова")
		.ДобавитьТест("ПутевойЛистУспешноеПроведение", 				"", "Позитив, Нефедова")
		.ДобавитьТест("РасходТопливаНеуспешноеПроведение",			"", "Негатив, Нефедова")
	;

КонецПроцедуры
 
Процедура РасходТопливаНеуспешноеПроведение() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.  

	// - Создание Справочник.Номенклатура
	НоменклатураСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.Номенклатура")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Родитель", Справочники.Номенклатура.ГСМ) 
		.Установить("Наименование", НСтр("ru = 'Тестовый'"))
		.Установить("Вид", Перечисления.ВидыТоваров.Топливо)  // Еще варианты: Товар, Услуга
		.Записать()
		;
	
	// - Создание Справочник.ТранспортныеСредства
	ТранспортСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.ТранспортныеСредства")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("РегистрационныйЗнак", НСтр("ru = 'Тест'")) 
		.Установить("Марка", НСтр("ru = 'Тест'")) 
		.Установить("Топливо", НоменклатураСсылка) 
		.Установить("НормаРасхода", 10)
		.Записать()
		;
		
	// - Создание Документ.РасходТоплива
	Документ = ЮТест.Данные().КонструкторОбъекта("Документ.РасходТоплива")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""Товары""", Истина))
			.ТабличнаяЧасть("Товары")
				.ДобавитьСтроку()
					.Установить("ТранспортноеСредство", ТранспортСсылка) 
					.Установить("Номенклатура", НоменклатураСсылка) 
					.Установить("Количество", 10)
		.Записать(Истина) // Проводим документ и возвращаем ссылку
		;
	
	// 2. Выполнение функции.
	
	// 3. Проверка результата.    
	ЮТест.ОжидаетЧто(Документ) // Объект, метод которого проверяем
	  .Метод("Записать")
	  	.Параметр(РежимЗаписиДокумента.Проведение)
		.Параметр(РежимПроведенияДокумента.Оперативный) // Указываем проверяемый метод и параметры вызова
	  .ВыбрасываетИсключение("Не удалось провести");  
	  
	Сообщения = ПолучитьСообщенияПользователю();
	ЮТест.ОжидаетЧто(Сообщения)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(1)
		.Свойство("[0].Текст") 
			.ИмеетТип("Строка") 
			.Содержит("Не хватает")
	;
	
КонецПроцедуры 
  
Процедура ПриходРасходТопливаУспешноеСоздание() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.  	
	// - Создание Справочник.Номенклатура
	НоменклатураСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.Номенклатура")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Родитель", Справочники.Номенклатура.ГСМ) 
		.Установить("Наименование", НСтр("ru = 'Тестовый'"))
		.Установить("Вид", Перечисления.ВидыТоваров.Топливо)  // Еще варианты: Товар, Услуга
		.Записать()
		;
	
	// - Создание Справочник.ТранспортныеСредства
	ТранспортСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.ТранспортныеСредства")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("РегистрационныйЗнак", НСтр("ru = 'Тест'")) 
		.Установить("Марка", НСтр("ru = 'Тест'")) 
		.Установить("Топливо", НоменклатураСсылка) 
		.Установить("НормаРасхода", 10)
		.Записать()
		;
	
	// - Создание Документ.ПриходТоплива
	ПоступлениеТопливаСсылка = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТоплива")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""Товары""", Истина)) 
		.Установить("Контрагент", Справочники.Контрагенты.НайтиПоНаименованию("Газпромнефть", Истина)) 
		.Установить("Валюта", Справочники.Валюты.НайтиПоНаименованию("Рубли", Истина))
			.ТабличнаяЧасть("Товары")
				.ДобавитьСтроку()
					.Установить("ТранспортноеСредство", ТранспортСсылка) 
					.Установить("Номенклатура", НоменклатураСсылка) 
					.Установить("Цена", 10) 
					.Установить("Количество", 10) 
					.Установить("Сумма", 1000) 
		.Записать() // Проводим документ и возвращаем ссылку
		;

	// - Создание Документ.РасходТоплива
	СписаниеТопливаСсылка = ЮТест.Данные().КонструкторОбъекта("Документ.РасходТоплива")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""Товары""", Истина))
			.ТабличнаяЧасть("Товары")
				.ДобавитьСтроку()
					.Установить("ТранспортноеСредство", ТранспортСсылка) 
					.Установить("Номенклатура", НоменклатураСсылка) 
					.Установить("Количество", 10)
		.Записать() // Проводим документ и возвращаем ссылку
		;

	
	// 2. Выполнение функции.
	
	// 3. Проверка результата.    		
	УсловиеПоиска = ЮТест.Предикат()
	    .Реквизит("Ссылка").Равно(ПоступлениеТопливаСсылка)
	    .Получить(); // Необходимо для сохранения сформированного предиката в переменную	
		
	ЮТест.ОжидаетЧтоТаблицаБазы("Документ.ПриходТоплива")
		.СодержитЗаписи(УсловиеПоиска);   
		
		
	УсловиеПоиска = ЮТест.Предикат()
	    .Реквизит("Ссылка").Равно(СписаниеТопливаСсылка)
	    .Получить(); // Необходимо для сохранения сформированного предиката в переменную	
		
	ЮТест.ОжидаетЧтоТаблицаБазы("Документ.РасходТоплива")
		.СодержитЗаписи(УсловиеПоиска); 
			
КонецПроцедуры 

Процедура ПутевойЛистУспешноеПроведение() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.  	
	//СгенерированныеДанные = ГенерацияТоварныхДокументов(Истина);	
	
	НоменклатураСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.Номенклатура")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Родитель", Справочники.Номенклатура.ГСМ) 
		.Установить("Наименование", НСтр("ru = 'Тестовый'"))
		.Установить("Вид", Перечисления.ВидыТоваров.Топливо)  // Еще варианты: Товар, Услуга
		.Записать()
		;
	
	// - Создание Справочник.ТранспортныеСредства
	ТранспортСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.ТранспортныеСредства")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("РегистрационныйЗнак", НСтр("ru = 'Тест'")) 
		.Установить("Марка", НСтр("ru = 'Тест'")) 
		.Установить("Топливо", НоменклатураСсылка) 
		.Установить("НормаРасхода", 10)
		.Записать()
		;
 
	// - Создание Справочник.Сотрудники
	СотрудникСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.Сотрудники")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", НСтр("ru = 'Тестовый'"))
		.Записать()
		;

	// - Создание Документ.ПутевойЛист
	ПутевойЛист = ЮТест.Данные().КонструкторОбъекта("Документ.ПутевойЛист")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""Товары""", Истина)) 
		.Установить("Валюта", Справочники.Валюты.НайтиПоНаименованию("Рубли", Истина)) 
		.Установить("ТранспортноеСредство", ТранспортСсылка) 
		.Установить("Сотрудник", СотрудникСсылка) 
		.Установить("НормаРасхода", 12) 
		.Установить("СуммаДокумента", 5280)
			.ТабличнаяЧасть("Маршрут")
				.ДобавитьСтроку()
					.Установить("ПунктОтправления", НСтр("ru = 'г. Новосибирск'")) 
					.Установить("ПунктНазначения", НСтр("ru = 'г. Кемерово'")) 
					.Установить("ОдометрНачало", 8000) 
					.Установить("ОдометрКонец", 8400) 
					.Установить("Расстояние", 400) 
					.Установить("РасходНорма", 33.33) 
					.Установить("Расход", 35) 
					.Установить("ДатаНачало", '2025.12.01 09:00:00') 
					.Установить("ДатаКонец", '2025.12.01 15:00:00')
			.ТабличнаяЧасть("Топливо")
				.ДобавитьСтроку()
					.Установить("Номенклатура", НоменклатураСсылка) 
					.Установить("Дата", '2025.12.01 00:00:00') 
					.Установить("Количество", 60) 
					.Установить("Цена", 88) 
					.Установить("Сумма", 5280)
		.Записать(Истина) // Проводим документ и возвращаем ссылку
		;

	// 2. Выполнение функции.
	
	// 3. Проверка результата.    		
	ЮТест.ОжидаетЧто(ПутевойЛист) // Объект, метод которого проверяем
	  .Метод("Записать")
	  	.Параметр(РежимЗаписиДокумента.Проведение)
		.Параметр(РежимПроведенияДокумента.Оперативный) // Указываем проверяемый метод и параметры вызова
	  .НеВыбрасываетИсключение();   
	  
	УсловиеПоиска = ЮТест.Предикат()
	    .Реквизит("Регистратор").Равно(ПутевойЛист.Ссылка)
	    .Получить(); // Необходимо для сохранения сформированного предиката в переменную		  
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.ОстаткиТопливаВБаке")
		.СодержитЗаписи(УсловиеПоиска);	 
		
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.ДвижениеТоплива")
		.СодержитЗаписи(УсловиеПоиска);	 
		
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти