
&НаКлиенте
Процедура ТопливоКоличествоПриИзменении(Элемент)
	
	Стр = Элементы.Топливо.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоЦенаПриИзменении(Элемент)
	
	Стр = Элементы.Топливо.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутОдометрНачалоПриИзменении(Элемент)
	
	Стр = Элементы.Маршрут.ТекущиеДанные;
	Стр.Расстояние = Стр.ОдометрКонец - Стр.ОдометрНачало; 
	Стр.РасходНорма = Стр.Расстояние / ?(Объект.НормаРасхода = 0, 1, Объект.НормаРасхода);
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутОдометрКонецПриИзменении(Элемент)
	
	Стр = Элементы.Маршрут.ТекущиеДанные;
	Стр.Расстояние = Стр.ОдометрКонец - Стр.ОдометрНачало;  
	Стр.РасходНорма = Стр.Расстояние / ?(Объект.НормаРасхода = 0, 1, Объект.НормаРасхода);

КонецПроцедуры

&НаКлиенте
Процедура МаршрутРасстояниеПриИзменении(Элемент)
	
	Стр = Элементы.Маршрут.ТекущиеДанные;
	Стр.ОдометрКонец = Стр.Расстояние + Стр.ОдометрНачало;  
	Стр.РасходНорма = Стр.Расстояние / ?(Объект.НормаРасхода = 0, 1, Объект.НормаРасхода);
	
КонецПроцедуры
